#ifndef KAR_H_COLL
#define KAR_H_COLL

#include "datatypes.h"
#include "obj.h"

typedef enum CollShapeKind
{
    Mp_CollShapeKind_Sphere,
} CollShapeKind;

typedef struct CollData
{
    struct CollData *next;         // 0x0
    GOBJ *g;                       // 0x4
    Vec3 pos1;                     // 0x8
    Vec3 pos_delta;                // 0x14
    Vec3 pos2;                     // 0x20
    int x2c;                       // 0x2c
    int x30;                       // 0x30
    int x34;                       // 0x34
    int x38;                       // 0x38
    int x3c;                       // 0x3c
    int x40;                       // 0x40
    int x44;                       // 0x44
    int x48;                       // 0x48
    int x4c;                       // 0x4c
    int x50;                       // 0x50
    int x54;                       // 0x54
    int x58;                       // 0x58
    int x5c;                       // 0x5c
    int x60;                       // 0x60
    int x64;                       // 0x64
    int x68;                       // 0x68
    int x6c;                       // 0x6c
    int x70;                       // 0x70
    int x74;                       // 0x74
    int x78;                       // 0x78
    int x7c;                       // 0x7c
    int x80;                       // 0x80
    int x84;                       // 0x84
    int x88;                       // 0x88
    int x8c;                       // 0x8c
    int x90;                       // 0x90
    int x94;                       // 0x94
    int x98;                       // 0x98
    int x9c;                       // 0x9c
    int xa0;                       // 0xa0
    int xa4;                       // 0xa4
    int xa8;                       // 0xa8
    int xac;                       // 0xac
    int xb0;                       // 0xb0
    int xb4;                       // 0xb4
    int xb8;                       // 0xb8
    int xbc;                       // 0xbc
    int xc0;                       // 0xc0
    int xc4;                       // 0xc4
    int xc8;                       // 0xc8
    int xcc;                       // 0xcc
    int xd0;                       // 0xd0
    int xd4;                       // 0xd4
    int xd8;                       // 0xd8
    int xdc;                       // 0xdc
    int xe0;                       // 0xe0
    int xe4;                       // 0xe4
    int xe8;                       // 0xe8
    int xec;                       // 0xec
    int xf0;                       // 0xf0
    int xf4;                       // 0xf4
    int xf8;                       // 0xf8
    int xfc;                       // 0xfc
    int x100;                      // 0x100
    int x104;                      // 0x104
    int x108;                      // 0x108
    int x10c;                      // 0x10c
    int x110;                      // 0x110
    int x114;                      // 0x114
    int x118;                      // 0x118
    int x11c;                      // 0x11c
    int x120;                      // 0x120
    int x124;                      // 0x124
    int x128;                      // 0x128
    int x12c;                      // 0x12c
    int x130;                      // 0x130
    int x134;                      // 0x134
    int x138;                      // 0x138
    int x13c;                      // 0x13c
    int x140;                      // 0x140
    int x144;                      // 0x144
    int x148;                      // 0x148
    int x14c;                      // 0x14c
    int x150;                      // 0x150
    int x154;                      // 0x154
    int x158;                      // 0x158
    int x15c;                      // 0x15c
    int x160;                      // 0x160
    int x164;                      // 0x164
    int x168;                      // 0x168
    int x16c;                      // 0x16c
    int x170;                      // 0x170
    int x174;                      // 0x174
    int x178;                      // 0x178
    int x17c;                      // 0x17c
    int x180;                      // 0x180
    int x184;                      // 0x184
    int x188;                      // 0x188
    int x18c;                      // 0x18c
    int x190;                      // 0x190
    int x194;                      // 0x194
    int x198;                      // 0x198
    int x19c;                      // 0x19c
    int x1a0;                      // 0x1a0
    int x1a4;                      // 0x1a4
    int x1a8;                      // 0x1a8
    int x1ac;                      // 0x1ac
    int x1b0;                      // 0x1b0
    int x1b4;                      // 0x1b4
    int x1b8;                      // 0x1b8
    int x1bc;                      // 0x1bc
    int x1c0;                      // 0x1c0
    int x1c4;                      // 0x1c4
    int x1c8;                      // 0x1c8
    int x1cc;                      // 0x1cc
    int x1d0;                      // 0x1d0
    int x1d4;                      // 0x1d4
    int x1d8;                      // 0x1d8
    int x1dc;                      // 0x1dc
    int x1e0;                      // 0x1e0
    int x1e4;                      // 0x1e4
    int x1e8;                      // 0x1e8
    int x1ec;                      // 0x1ec
    int x1f0;                      // 0x1f0
    int x1f4;                      // 0x1f4
    int x1f8;                      // 0x1f8
    int x1fc;                      // 0x1fc
    int x200;                      // 0x200
    int x204;                      // 0x204
    int x208;                      // 0x208
    int x20c;                      // 0x20c
    int x210;                      // 0x210
    int x214;                      // 0x214
    int x218;                      // 0x218
    int x21c;                      // 0x21c
    int x220;                      // 0x220
    int x224;                      // 0x224
    int x228;                      // 0x228
    int x22c;                      // 0x22c
    int x230;                      // 0x230
    int x234;                      // 0x234
    int x238;                      // 0x238
    int x23c;                      // 0x23c
    int x240;                      // 0x240
    int x244;                      // 0x244
    int x248;                      // 0x248
    int x24c;                      // 0x24c
    int x250;                      // 0x250
    int x254;                      // 0x254
    int x258;                      // 0x258
    int x25c;                      // 0x25c
    int x260;                      // 0x260
    int x264;                      // 0x264
    int x268;                      // 0x268
    int x26c;                      // 0x26c
    int x270;                      // 0x270
    int x274;                      // 0x274
    int x278;                      // 0x278
    int x27c;                      // 0x27c
    int x280;                      // 0x280
    int x284;                      // 0x284
    int x288;                      // 0x288
    int x28c;                      // 0x28c
    int x290;                      // 0x290
    int x294;                      // 0x294
    int x298;                      // 0x298
    int x29c;                      // 0x29c
    int x2a0;                      // 0x2a0
    int x2a4;                      // 0x2a4
    int x2a8;                      // 0x2a8
    int x2ac;                      // 0x2ac
    int x2b0;                      // 0x2b0
    int x2b4;                      // 0x2b4
    int x2b8;                      // 0x2b8
    int x2bc;                      // 0x2bc
    int x2c0;                      // 0x2c0
    int x2c4;                      // 0x2c4
    int x2c8;                      // 0x2c8
    int x2cc;                      // 0x2cc
    int x2d0;                      // 0x2d0
    int x2d4;                      // 0x2d4
    int x2d8;                      // 0x2d8
    int x2dc;                      // 0x2dc
    int x2e0;                      // 0x2e0
    int x2e4;                      // 0x2e4
    int x2e8;                      // 0x2e8
    int x2ec;                      // 0x2ec
    int x2f0;                      // 0x2f0
    int x2f4;                      // 0x2f4
    int x2f8;                      // 0x2f8
    int x2fc;                      // 0x2fc
    int x300;                      // 0x300
    int x304;                      // 0x304
    int x308;                      // 0x308
    int x30c;                      // 0x30c
    int x310;                      // 0x310
    int x314;                      // 0x314
    int x318;                      // 0x318
    int x31c;                      // 0x31c
    int x320;                      // 0x320
    int x324;                      // 0x324
    int x328;                      // 0x328
    int x32c;                      // 0x32c
    int x330;                      // 0x330
    int x334;                      // 0x334
    int x338;                      // 0x338
    CollShapeKind coll_shape_kind; // 0x33c
    struct CollShapeData           // 0x340
    {
        u8 x0[0x30];
        float radius; // 0x30
    } *shape_data;
    int x344; // 0x344
    int x348; // 0x348
    int x34c; // 0x34c
    int x350; // 0x350
    int x354; // 0x354
    int x358; // 0x358
    int x35c; // 0x35c
    int x360; // 0x360
    int x364; // 0x364
    int x368; // 0x368
    int x36c; // 0x36c
    int x370; // 0x370
    int x374; // 0x374
    int x378; // 0x378
    int x37c; // 0x37c
    int x380; // 0x380
    int x384; // 0x384
    int x388; // 0x388
    int x38c; // 0x38c
    int x390; // 0x390
    int x394; // 0x394
    int x398; // 0x398
    int x39c; // 0x39c
    int x3a0; // 0x3a0
    int x3a4; // 0x3a4
    int x3a8; // 0x3a8
    int x3ac; // 0x3ac
    int x3b0; // 0x3b0
    int x3b4; // 0x3b4
    int x3b8; // 0x3b8
    int x3bc; // 0x3bc
    int x3c0; // 0x3c0
    int x3c4; // 0x3c4
    int x3c8; // 0x3c8
    int x3cc; // 0x3cc
    int x3d0; // 0x3d0
    int x3d4; // 0x3d4
    int x3d8; // 0x3d8
    int x3dc; // 0x3dc
    int x3e0; // 0x3e0
    int x3e4; // 0x3e4
    int x3e8; // 0x3e8
    int x3ec; // 0x3ec
    int x3f0; // 0x3f0
    int x3f4; // 0x3f4
    int x3f8; // 0x3f8
    int x3fc; // 0x3fc
} CollData;

#endif